work/linux_0.11_learn.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>linux_0.11_learn</title>
<!-- 2016-08-25 Thu 10:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="fangzheng" />
</head>
<body>
<div id="content">
<h1 class="title">linux_0.11_learn</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. Linux 内核体系结构</a>
<ul>
<li><a href="#sec-2-1">2.1. Linux内核堆内存的使用方法</a></li>
<li><a href="#sec-2-2">2.2. 引导启动程序</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
fs/ 文件系统程序，看之前最好看下 Andrew S.Tanenbaum 的<br  />
《操作系统设计与实现》有关 MINIX 文件系统的章节。<br  />
</p>

<p>
mm/ 内存管理程序，需要了解 intel 80x86 微处理器的保护模式<br  />
运行方式有足够的理解。参考《intel 80386 programmer's Reference Manual》<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Linux 内核体系结构</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Linux内核堆内存的使用方法</h3>
<div class="outline-text-3" id="text-2-1">
<p>
应用程序员仅需与『逻辑地址』打交道，『分段』和『分页』机制对他来说是透明的。<br  />
『分页』机制启动，『线性地址』就是『物理地址』<br  />
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 引导启动程序</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>PC 电源打开，80x86 结构 cpu 将进入『实模式』，并从地址0xFFFF0开始自动执行<br  />
</li>
</ol>
<p>
程序代码，这个地址通常是 ROM-BIOS 中的地址。<br  />
</p>
<ol class="org-ol">
<li>bootsect.s 代码是磁盘引导块程序，驻留在磁盘的第一个扇区。由 BIOS 加载到内存<br  />
</li>
</ol>
<p>
0x7C00 处，然后将自己移动奥内存0X90000处。<br  />
</p>
<ol class="org-ol">
<li>bootsect 将 setup 模块（setup.s） 从磁盘加载到内存，跟在 bootsect 后面，<br  />
</li>
</ol>
<p>
然后利用 bios 中断0x13取磁盘参数表中当前启动引导盘的参数，出现"Loding system"。<br  />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: fangzheng</p>
<p class="date">Created: 2016-08-25 Thu 10:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
